src/grafana/servicetopology/clusters.dot
digraph {
    rankdir="LR"
    compound=true
    ordering=out
    layout=fdp
    node [shape=circle]
    edge [style=solid]
    subgraph cluster_checkoutservice {
    label = "checkoutservice"
    labeljust = l
    shape = circle
    }
    subgraph cluster_accountingservice {
    label = "accountingservice"
    labeljust = l
    shape = circle
    }
    subgraph cluster_frauddetectionservice {
    label = "frauddetectionservice"
    labeljust = l
    shape = circle
    }
    subgraph cluster_cartservice {
    label = "cartservice"
    labeljust = l
    shape = circle
    }
    subgraph cluster_currencyservice {
    label = "currencyservice"
    labeljust = l
    shape = circle
    }
    subgraph cluster_emailservice {
    label = "emailservice"
    labeljust = l
    shape = circle
    }
    subgraph cluster_paymentservice {
    label = "paymentservice"
    labeljust = l
    shape = circle
    }
    subgraph cluster_productcatalogservice {
    label = "productcatalogservice"
    labeljust = l
    shape = circle
    }
    subgraph cluster_shippingservice {
    label = "shippingservice"
    labeljust = l
    shape = circle
    }
    subgraph cluster_frontend {
    label = "frontend"
    labeljust = l
    shape = circle
    }
    subgraph cluster_adservice {
    label = "adservice"
    labeljust = l
    shape = circle
    }
    subgraph cluster_recommendationservice {
    label = "recommendationservice"
    labeljust = l
    shape = circle
    }
    subgraph cluster_loadgenerator {
    label = "loadgenerator"
    labeljust = l
    shape = circle
    }
    subgraph cluster_quoteservice {
    label = "quoteservice"
    labeljust = l
    shape = circle
    }
    cluster_checkoutservice -> cluster_accountingservice [label="0.25"]
    cluster_checkoutservice -> cluster_frauddetectionservice [label="0.02"]
    cluster_checkoutservice -> cluster_cartservice [label="0.55"]
    cluster_checkoutservice -> cluster_currencyservice [label="0.38"]
    cluster_checkoutservice -> cluster_emailservice [label="0.18"]
    cluster_checkoutservice -> cluster_paymentservice [label="0.20"]
    cluster_checkoutservice -> cluster_productcatalogservice [label="0.44"]
    cluster_checkoutservice -> cluster_shippingservice [label="0.44"]
    cluster_frontend -> cluster_adservice [label="0.13"]
    cluster_frontend -> cluster_cartservice [label="1.27"]
    cluster_frontend -> cluster_checkoutservice [label="0.18"]
    cluster_frontend -> cluster_productcatalogservice [label="2.11"]
    cluster_frontend -> cluster_recommendationservice [label="0.16"]
    cluster_loadgenerator -> cluster_frontend [label="2.47"]
    cluster_recommendationservice -> cluster_productcatalogservice [label="0.16"]
    cluster_shippingservice -> cluster_quoteservice [label="0.25"]
}
